uat_chat/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДополнительныеСведенияЗаявок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.юкМестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦехМаршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоОказанияУслуг</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоТС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПодачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПодачи2см</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВозврата2см</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасовОтстоя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуточныйПробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д5</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д6</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д7</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д8</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д9</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д10</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д11</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д12</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д13</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д14</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д15</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д16</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д17</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д18</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д19</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д20</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д21</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д22</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д23</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д24</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д25</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д26</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д27</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д28</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д29</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д30</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>д31</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаИсходныхДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеИдентификаторов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>90</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лог</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиЭксель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключитьИзПроведения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиЛота</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/Documents/Заявка/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	мНаборЗаписейДополнительныеСведенияЗаявок = Движения.ДополнительныеСведенияЗаявок;
	мНаборЗаписейДополнительныеСведенияЗаявок.Записывать = Истина;
	
	мТаблицаСоставаЗаявки = Состав.Выгрузить();
	Для мИтр = 1 По День(КонецМесяца(Дата)) Цикл	//контроль количества дней в месяце - на совести формы документа
		Если Состав.Итог("д" + мИтр) > 0 Тогда	//время выполнения минимальное, но иногда ускорит проведение
			мДата = НачалоМесяца(Дата) + (86400 * (мИтр - 1));
			мКопияТаблицаСоставаЗаявки = мТаблицаСоставаЗаявки.Скопировать();
			//фактически, теперь можно не сворачивать, набор измерений и реквизитов полностью дублирует ТЧ, кроме СтрокаИсходныхДанных - которая в регистре нам не нужна
			//мКопияТаблицаСоставаЗаявки.Свернуть("ТипТС, ЦехМаршрут, ВремяПодачи, ХранилищеИдентификаторов, Ответственный, РежимРаботы, ЧасовОтстоя, СуточныйПробег, Комментарий, д" + мИтр, "КоличествоТС");
			
			Для Каждого мСтрока Из Состав Цикл
				Если мСтрока["д" + Число(мИтр)] И мСтрока.КоличествоТС > 0 И Не мСтрока.ИсключитьИзПроведения Тогда
					мМассивИдентификаторов = мСтрока.ХранилищеИдентификаторов.Получить();
					Для Итр = 0 По мМассивИдентификаторов.Количество() - 1 Цикл
						мНоваяЗапись = мНаборЗаписейДополнительныеСведенияЗаявок.Добавить();
						ЗаполнитьЗначенияСвойств(мНоваяЗапись, мСтрока);
						мНоваяЗапись.Регистратор = Ссылка;
						мНоваяЗапись.ИдентификаторСтрокиЗаявки = мМассивИдентификаторов[Итр];
						мНоваяЗапись.Период = мДата;
						мНоваяЗапись.ВремяПодачи = ?(Итр >= мСтрока.КоличествоТС, мСтрока.ВремяПодачи2см, мСтрока.ВремяПодачи);
						мНоваяЗапись.ВремяВозврата = ?(Итр >= мСтрока.КоличествоТС, мСтрока.ВремяВозврата2см, мСтрока.ВремяВозврата);
						мНоваяЗапись.Контрагент = Контрагент;
						мНоваяЗапись.КоличествоТС = 1;
						мНоваяЗапись.МестоРаботы = МестоРаботы;
						мНоваяЗапись.ИсходныеДанные = ?(ЗначениеЗаполнено(СокрЛП(мСтрока.СтрокаИсходныхДанных)), СтрЗаменить(СтрЗаменить(мСтрока.СтрокаИсходныхДанных, "&", " / "), "..", "--"), "");
						мНоваяЗапись.ИдентификаторСтрокиЛота = мСтрока.ИдентификаторСтрокиЛота;
						//закомментировано в связи с переходом на 1 регистр Разнарядка (без регистра с Уточнениями)
						////место оказания услуг задано явно
						//Если ЗначениеЗаполнено(мСтрока.МестоОказанияУслуг) Тогда
						//	мНоваяЗаписьУточнения = РегистрыСведений.Разнарядка.СоздатьМенеджерЗаписи();
						//	ЗаполнитьЗначенияСвойств(мНоваяЗаписьУточнения, мСтрока);
						//	мНоваяЗаписьУточнения.Дата = мДата;
						//	мНоваяЗаписьУточнения.ВремяПодачи = ?(Итр > мСтрока.КоличествоТС, мСтрока.ВремяПодачи2см, мСтрока.ВремяПодачи);
						//	мНоваяЗаписьУточнения.ИдентификаторСтрокиЗаявки = мМассивИдентификаторов[Итр];
						//	мНоваяЗаписьУточнения.Записать(Истина);
						//КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоМесяца(Дата);
	Для Каждого мСтрока Из Состав Цикл
		мМассивИдентификаторовСтрок = мСтрока.ХранилищеИдентификаторов.Получить();
		Если мСтрока.СтрокаИсходныхДанных = "Очистить хранилище" Или Не ЗначениеЗаполнено(мМассивИдентификаторовСтрок)Тогда
			мМассивИдентификаторовСтрок = Новый Массив;
			Для Итр = 1 По мСтрока.КоличествоТС * ?(ЗначениеЗаполнено(мСтрока.ВремяПодачи2см), 2, 1) Цикл
				мМассивИдентификаторовСтрок.Добавить(СокрЛП(Новый УникальныйИдентификатор()));
			КонецЦикла;
			мСтрока.ХранилищеИдентификаторов = Новый ХранилищеЗначения(мМассивИдентификаторовСтрок);
			Если мСтрока.СтрокаИсходныхДанных = "Очистить хранилище" Тогда
				мСтрока.СтрокаИсходныхДанных = "";
			КонецЕсли;
		Иначе
			Если мМассивИдентификаторовСтрок.Количество() <> мСтрока.КоличествоТС * ?(ЗначениеЗаполнено(мСтрока.ВремяПодачи2см), 2, 1) Тогда
				Если мМассивИдентификаторовСтрок.Количество() > мСтрока.КоличествоТС * ?(ЗначениеЗаполнено(мСтрока.ВремяПодачи2см), 2, 1) Тогда
					мМассивУдаляемыхИдентификаторов = Новый Массив;
					Для Итр = 1 По мМассивИдентификаторовСтрок.Количество() - (мСтрока.КоличествоТС * ?(ЗначениеЗаполнено(мСтрока.ВремяПодачи2см), 2, 1)) Цикл
						//удаляем с конца, если перебор
						//TODO: Переписать для удаления с конца для обеих смен?... но добавление-то всегда в конец... Дилемма...
						мИндексУдаляемого = мМассивИдентификаторовСтрок.Количество() - 1;
						мМассивУдаляемыхИдентификаторов.Добавить(мМассивИдентификаторовСтрок[мИндексУдаляемого]);
						мМассивИдентификаторовСтрок.Удалить(мИндексУдаляемого);
					КонецЦикла;
					//TODO: ОбработкаУдаления(мМассивУдаляемыхИдентификаторов);
				Иначе
					Для Итр = 1 По (?(ЗначениеЗаполнено(мСтрока.ВремяПодачи2см), 2, 1) * мСтрока.КоличествоТС) - мМассивИдентификаторовСтрок.Количество() Цикл
						//добавляем, если недобор
						мМассивИдентификаторовСтрок.Добавить(СокрЛП(Новый УникальныйИдентификатор()));
					КонецЦикла;
				КонецЕсли;
				мСтрока.ХранилищеИдентификаторов = Новый ХранилищеЗначения(мМассивИдентификаторовСтрок);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для Каждого мСтрока Из Состав Цикл
		мИндекс = Состав.Индекс(мСтрока);
		мСтрокаОбъектаКопирования = ОбъектКопирования.Состав.Получить(мИндекс);
		мСтрока.ХранилищеИдентификаторов = Новый ХранилищеЗначения(мСтрокаОбъектаКопирования.ХранилищеИдентификаторов.Получить());
	КонецЦикла;
	Дата = НачалоМесяца(КонецМесяца(ОбъектКопирования.Дата) + 1);
	ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры
